export const translateToCN = {
	R: '现实型',
	E: '企业型',
	S: '社会型',
	I: '科技型',
	C: '综合型',
	A: '艺术型',
	Realistic: '现实型',
	Enterprising: '企业型',
	Social: '社会型',
	Investigative: '科研型',
	Conventional: '综合型', 
	Artistic: '艺术型',
}
export const resultDescription = {
	R: ['喜欢具体实际的事物，坦诚清晰并富有常识', '使用手工或机械技能对物体、工具、机器、动物等进行操作，与“事物”工作的能力比“人”打交道更出色'],
	I: ['热爱学习知识，独立自主追求极致', '运用复杂和抽象的思考分析研究问题，并且有能力提出创造性的解决方式，'],
	A: ['富有创造力和表达能力，以独特的方式来表现自己，思想自由开放', '喜欢自我表达，在文学、音乐和艺术等方面有出众的造诣'],
	S: ['具有良好的人际交往能力，富有责任感', '喜欢与人合作，热情关心他人的幸福。愿意帮助他人成长或者解决困难'],
	E: ['具有团体凝聚力和组织力', '拥有说服他人或者支配他人的能力，能够成为团队的主导，目标明确并敢于承担风险'],
	C: ['条理清晰，为人随和，处事低调', '对准确性有着较高的要求，主动遵守并维护规章制度，将一切都处理得井井有条']
}
export const list=[
			{
				id:"R",
				text:"相较于事物，我更善于和人打交道"
			},
			{
				id:"E",
				text:"我感觉我不太喜欢去领导他人"
			},
			{
				id:"S",
				text:"我更喜欢独立完成任务"
			},
			{
				id:"I",
				text:"在思考这方面，我一般不会想得太复杂"
			},
			{
				id:"C",
				text:"对于有些规章制度，我想还是打破比较好"
			},
			{
				id:"A",
				text:"我不太喜欢自我表达，还是低调一点比较好"
			},
]
export const idList=[
	"R","E","S","A","C","I"
]